Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.GetMainEnergyAnalysisDetailModel(Autodesk.Revit.DB.Document)
Gets the EnergyAnalysisDetailModel in given document.
document:
The document that contains the physical model of the building.
Returns:
Returns the EnergyAnalysisDetailModel contained in the document, if it exists. If it does not exist, this returns null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions)
Creates a new energy analysis detailed model.
Remarks:
The generated energy model is always returned in world coordinates.
The method TransformModel() transforms all surfaces in the model according to
ground plane, shared coordinates and true north.
The EnergyModelType in argument EnergyAnalysisDetailModelOptions indicates
whether the generated energy model is based on rooms/spaces or building elements. The default value
is EnergyModelType.SpatialElement.
document:
The document that contains the physical model of the building.
options:
The options to control the calculation rules.
Returns:
The created model instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
An EnergyAnalysisDetailModel cannot be created if EnergyModelType.BuildingElement is input
and AnalysisMode.ConceptualMasses is set in EnergyDataSettings (these values are incompatible).
-or-
Throws if there are no valid spatial bounding elements,
or no valid spatial elements in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the energy analysis detail model.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Throws if user aborted the energy analysis detail model creation.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.ExportCategory
Export elements of this category in energy analysis.
Remarks:
Export will be based on the space type associated with the product creating it.
Valid categories are Rooms or MEP Spaces.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.BuildingTypeId
The building type element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012